string1 = "Даян узбек"
string2 = "Хаятов"
str_summ = string1 + string2 #Конкатенация (сложение) строк
# print(str_summ)

# print((str_summ + " ")* 3) #Дублирование строки

# print(len(string1)) #Длина строки 

#Извлечение среза
#Оператор извлечения среза: [X:Y]. X – начало среза, а Y – окончание;
#Cимвол с номером Y в срез не входит. По умолчанию первый индекс равен 0, а второй - длине строки.

# print(string1[:-1]) 

# print(string1.find("к")) #Поиск подстроки в строке

# print(string1.split(",")) #Разбиение строки по разделителю

# print(string1.isalpha()) #Состоит ли строка из букв

# print(string1.isspace()) #Состоит ли строка из неотображаемых символов (пробел, символ перевода страницы ('\f'), "новая строка" ('\n'), "перевод каретки" ('\r'), "горизонтальная табуляция" ('\t') и "вертикальная табуляция" ('\v'))

# print(ord("А")) #Символ в его код ASCII


